import 'package:proj_3/models/quiz_question.dart';
import 'package:flutter/material.dart';

var questions = [
  QuizQuestion(
    Image.asset('assets/images/p_z_1_1.png', width: 200,),
    [
      'Железнодорожный переезд со шлагбаумом',
      'Железнодорожный переезд без шлагбаума',
      'Однопутная железная дорога',
      'Многопутная железная дорога',
    ],
  ),
  QuizQuestion(
    Image.asset('assets/images/p_z_1_2.png', width: 200,),
    [
      'Железнодорожный переезд без шлагбаума',
      'Железнодорожный переезд со шлагбаумом',
      'Однопутная железная дорога',
      'Многопутная железная дорога',
    ],
  ),
  QuizQuestion(
    Image.asset('assets/images/p_z_1_3_1.png', width: 200,),
    [
      'Однопутная железная дорога',
      'Железнодорожный переезд без шлагбаума',
      'Железнодорожный переезд со шлагбаумом',
      'Многопутная железная дорога',
    ],
  ),
  QuizQuestion(
    Image.asset('assets/images/p_z_1_3_2.png', width: 200,),
    [
      'Многопутная железная дорога',
      'Однопутная железная дорога',
      'Железнодорожный переезд без шлагбаума',
      'Железнодорожный переезд со шлагбаумом',
    ],
  ),
];
